# -*- coding: utf-8 -*-
#
# ガチャの確率設定とボックス
#
# 景品はアタリとハズレのグループに分けて考える
# アタリの景品だけにレートを設定
# (1.0 - アタリの確率合計) がハズレを引く確率
# それをハズレの数で等分したのがハズレ1つを引く確率にする
# あとは 0.0...1.0 の間で範囲をうめていく (1.0は含まない)

require "pp"
require "rain_table"

# ボックス定義
# 景品自体に確率が定義されているように見えるけど
# 景品レコード自体に確率を持たせると融通が効かなくなる
# 景品レコードにデフォルトの確率を持たせるのはありかも
# また景品レコードに「当選確率の倍率」を持つのもいいかも
# そうするとイベント期間内だけそのカードのアタリが 1.5 倍になるなど調整可
box = [
  {:name => "ロトの剣", :rate => 0.001}, # 1/1000 のこと
  {:name => "炎の剣",   :rate => 0.005}, # 5/1000 のこと
  {:name => "鋼の剣",   :rate => 0.01},
  {:name => "鉄の斧",   :rate => 0.01},
  # ハズレには確率を設定しないの重要
  {:name => "こんぼう"},
  {:name => "たけざお"},
]
tt box

# 準備
group1 = box.find_all{|item|item[:rate]} # ドロップ率の指定があるもの
group2 = box - group1                    # ないもの

total = group1.collect{|item|item[:rate]}.reduce(:+)
other_rate = (1.0 - total) / group2.size

base = 0.0
box.each do |item|
  rate = item[:rate] || other_rate
  item.update("範囲" => (base ... (base + rate)), :rate => rate)
  base += rate
end
tt box

# ガチャる
N = 10000000
N.times do
  r = rand
  item = box.find{|item|item["範囲"].include?(r)} # !> shadowing outer local variable - item
  item["ドロップ数"] ||= 0
  item["ドロップ数"] += 1
end

# 統計
box.each do |item|
  real_rate = item["ドロップ数"].to_f / N
  diff = real_rate - item[:rate]
  item.update("実際の確率" => real_rate, "確率差分" => "%.7f" % diff)
end

tt box
# >> +----------+-------+
# >> | name     | rate  |
# >> +----------+-------+
# >> | ロトの剣 | 0.001 |
# >> | 炎の剣   | 0.005 |
# >> | 鋼の剣   |  0.01 |
# >> | 鉄の斧   |  0.01 |
# >> | こんぼう |       |
# >> | たけざお |       |
# >> +----------+-------+
# >> +----------+-------+------------------------------+
# >> | name     | rate  | 範囲                         |
# >> +----------+-------+------------------------------+
# >> | ロトの剣 | 0.001 | 0.0...0.001                  |
# >> | 炎の剣   | 0.005 | 0.001...0.006                |
# >> | 鋼の剣   |  0.01 | 0.006...0.016                |
# >> | 鉄の斧   |  0.01 | 0.016...0.026000000000000002 |
# >> | こんぼう | 0.487 | 0.026000000000000002...0.513 |
# >> | たけざお | 0.487 | 0.513...1.0                  |
# >> +----------+-------+------------------------------+
# >> +----------+-------+------------------------------+------------+------------+------------+
# >> | name     | rate  | 範囲                         | ドロップ数 | 実際の確率 | 確率差分   |
# >> +----------+-------+------------------------------+------------+------------+------------+
# >> | ロトの剣 | 0.001 | 0.0...0.001                  |      10044 |  0.0010044 |  0.0000044 |
# >> | 炎の剣   | 0.005 | 0.001...0.006                |      49546 |  0.0049546 | -0.0000454 |
# >> | 鋼の剣   |  0.01 | 0.006...0.016                |     100232 |  0.0100232 |  0.0000232 |
# >> | 鉄の斧   |  0.01 | 0.016...0.026000000000000002 |     100419 |  0.0100419 |  0.0000419 |
# >> | こんぼう | 0.487 | 0.026000000000000002...0.513 |    4868264 |  0.4868264 | -0.0001736 |
# >> | たけざお | 0.487 | 0.513...1.0                  |    4871495 |  0.4871495 |  0.0001495 |
# >> +----------+-------+------------------------------+------------+------------+------------+
