# -*- coding: utf-8 -*-
#
# ガチャの確率設定とボックス
#
# 景品はアタリとハズレの2つのグループに分けて考える
# アタリの景品だけにレートを設定する
# (1.0 - アタリの確率合計) がハズレを引く確率
# それをハズレ景品の数で等分したのがハズレ景品1つを引く確率にする
# あとは 0.0...1.0 の間で範囲をうめていく(1.0は含まないこと)

require "pp"
require "rain_table"

# ボックス定義
# 景品自体に確率が定義されているように見えるけど
# 景品レコード自体に確率を持たせるのは融通が効かなくなりそうなので避けた方がよさそう
# 景品レコード自体にはデフォルトの確率を持たせるのはいいかも
# あと全体で土日だけで特定の景品だけを確率2倍になるようなイベントをすることを考慮して
# 景品レコードに「当選確率の倍率」を持つのもいいかもしれない。デフォルトは 1.0 で土日だけ 1.5 にするなど。
box = [
  {:name => "ロトの剣", :rate => 0.001}, # 1/10000 のこと
  {:name => "炎の剣",   :rate => 0.002}, # 2/10000 のこと
  {:name => "鋼の剣",   :rate => 0.01},
  {:name => "鉄の斧",   :rate => 0.02},
  # ハズレには確率を設定しないの重要
  {:name => "こんぼう"},
  {:name => "たけざお"},
]
tt box

# 準備
group1 = box.find_all{|item|item[:rate]} # ドロップ率の指定があるもの
group2 = box - group1              # ないもの

total = group1.collect{|item|item[:rate]}.reduce(:+)
other_rate = (1.0 - total) / group2.size

base = 0.0
box.each do |item|
  rate = item[:rate] || other_rate
  item.update("範囲" => (base ... (base + rate)), :rate => rate).tap { base += rate }
end
tt box

# ガチャる
N = 10000000
N.times do
  r = rand
  item = box.find{|item|item["範囲"].include?(r)} # !> shadowing outer local variable - item
  item["ドロップ数"] ||= 0
  item["ドロップ数"] += 1
end

# 統計
box.each do |item|
  real_rate = item["ドロップ数"].to_f / N
  diff = real_rate - item[:rate]
  item.update("実際の確率" => real_rate, "確率差分" => "%.7f" % diff)
end

tt box
# >> +----------+-------+
# >> | name     | rate  |
# >> +----------+-------+
# >> | ロトの剣 | 0.001 |
# >> | 炎の剣   | 0.002 |
# >> | 鋼の剣   |  0.01 |
# >> | 鉄の斧   |  0.02 |
# >> | こんぼう |       |
# >> | たけざお |       |
# >> +----------+-------+
# >> +----------+--------+------------------------------+
# >> | name     | rate   | 範囲                         |
# >> +----------+--------+------------------------------+
# >> | ロトの剣 |  0.001 | 0.0...0.001                  |
# >> | 炎の剣   |  0.002 | 0.001...0.003                |
# >> | 鋼の剣   |   0.01 | 0.003...0.013000000000000001 |
# >> | 鉄の斧   |   0.02 | 0.013000000000000001...0.033 |
# >> | こんぼう | 0.4835 | 0.033...0.5165               |
# >> | たけざお | 0.4835 | 0.5165...1.0                 |
# >> +----------+--------+------------------------------+
# >> +----------+--------+------------------------------+------------+------------+------------+
# >> | name     | rate   | 範囲                         | ドロップ数 | 実際の確率 | 確率差分   |
# >> +----------+--------+------------------------------+------------+------------+------------+
# >> | ロトの剣 |  0.001 | 0.0...0.001                  |       9911 |  0.0009911 | -0.0000089 |
# >> | 炎の剣   |  0.002 | 0.001...0.003                |      20219 |  0.0020219 |  0.0000219 |
# >> | 鋼の剣   |   0.01 | 0.003...0.013000000000000001 |     100661 |  0.0100661 |  0.0000661 |
# >> | 鉄の斧   |   0.02 | 0.013000000000000001...0.033 |     199581 |  0.0199581 | -0.0000419 |
# >> | こんぼう | 0.4835 | 0.033...0.5165               |    4837395 |  0.4837395 |  0.0002395 |
# >> | たけざお | 0.4835 | 0.5165...1.0                 |    4832233 |  0.4832233 | -0.0002767 |
# >> +----------+--------+------------------------------+------------+------------+------------+
